In [6]:
import pandas as pd

In [7]:
file_path = (r"C:\Users\adaiu\OneDrive\Desktop\Analysis Projects\Electric-Car-Data-Analysis\Resources\Income\BEA City Income 2018-2020.csv")
bea_city_income_df = pd.read_csv(file_path)
bea_city_income_df.head()

                      City State    2018    2019    2020
0                  Abilene    TX  44,039  46,493  49,948
1                    Akron    OH  49,770  51,714  54,843
2                   Albany    GA  36,889  38,764  42,744
3           Albany-Lebanon    OR  42,811  43,971  48,040
4  Albany-Schenectady-Troy    NY  57,743  60,500  65,112